<?php

test('без копеек', function ($sum, $result, $roundSum = true) {
    expect(sumInWords($sum, $roundSum))->toBe($result);
})->with([
    [1, 'один рубль'],
    [2, 'два рубля'],
    [5, 'пять рублей'],
    [19, 'девятнадцать рублей'],
    [42, 'сорок два рубля'],
    [123, 'сто двадцать три рубля'],
    [990, 'девятьсот девяносто рублей'],

    [100000, 'сто тысяч рублей'],
    [111000, 'сто одиннадцать тысяч рублей'],
    [1000000, 'один миллион рублей'],
    [1100000, 'один миллион сто тысяч рублей'],
    [1100000000, 'один миллиард сто миллионов рублей'],
    [1000100, 'один миллион сто рублей'],
    [335871, 'триста тридцать пять тысяч восемьсот семьдесят один рубль'],

    [1 . str_repeat('0', 33), 'один дециллион рублей'],
    [
        '1234567891234567890',
        'один квинтиллион двести тридцать четыре квадриллиона пятьсот шестьдесят семь триллионов восемьсот девяносто один миллиард двести тридцать четыре миллиона пятьсот шестьдесят семь тысяч восемьсот девяносто рублей'
    ],
]);

test('с копейками', function ($sum, $result, $roundSum = false) {
    expect(sumInWords($sum, $roundSum))->toBe($result);
})->with([
    [0.96, 'ноль рублей 96 копеек'],

    [1, 'один рубль 00 копеек'],
    [1.01, 'один рубль 01 копейка'],
    [1.02, 'один рубль 02 копейки'],
    [1.05, 'один рубль 05 копеек'],
]);

it('throws OverflowException', function () {
    sumInWords(1000 . str_repeat('0', 33));
})->throws(OverflowException::class);
